# TFTP Client Usage on RHEL/CentOS

This guide covers how to install and use TFTP client utilities (`tftp` and `atftp`) for file transfers over a network using the Trivial File Transfer Protocol (TFTP).

## Installing TFTP Client Utilities
TFTP clients allow you to download or upload files to a TFTP server.

### Install the basic TFTP client
This command installs the standard `tftp` client utility.
```bash
yum install tftp
```

### Install the advanced TFTP client (atftp)
This command installs `atftp`, a more feature-rich alternative to the default client.
```bash
yum install atftp
```

## Setting Transfer Mode to Binary
Binary mode is necessary when transferring non-text files (e.g., executables, images).

### Set transfer mode to binary
```bash
tftp> binary
```

This ensures that files are transferred byte-for-byte, preventing corruption.

## Checking Status of TFTP Session
This helps verify the session settings such as transfer mode and server IP.

### Check current session status
```bash
tftp> status
```

Example output:
```
Connected to 192.168.95.145.
Mode: binary
Timeout: 10 seconds
```

## Common Interactive TFTP Commands
Useful commands during an interactive TFTP session:

| Command         | Description                                  |
|----------------|----------------------------------------------|
| `mode`         | Show current transfer mode                   |
| `verbose`      | Enable verbose output                        |
| `timeout <sec>`| Set timeout value for responses              |
| `connect`      | Set/change the TFTP server                   |
| `get <file>`   | Download a file                              |
| `put <file>`   | Upload a file                                |
| `quit`         | Exit the TFTP client                         |

## Testing File Download (GET Operation)

### Connect to the server and download a file interactively
```bash
tftp 192.168.95.145
tftp> get testfile.txt
tftp> quit
```

### One-liner to download a file
```bash
tftp -v 192.168.95.145 -c get testfile.txt
```

## Testing File Upload (PUT Operation)

### Connect to the server and upload a file interactively
```bash
tftp 192.168.95.145
tftp> put sample.txt
tftp> quit
```

### One-liner to upload a file
```bash
tftp -v 192.168.95.145 -c put sample.txt
```

## Downloading a File Using atftp (GET Operation)
Use `atftp` to download a file from the TFTP server.
```bash
atftp -g -r messages -l messages 192.168.95.145
```

- `-g`: Get/download
- `-r messages`: Remote file on server
- `-l messages`: Local filename to save as
- `192.168.95.145`: TFTP server IP

## Uploading a File Using atftp (PUT Operation)
Use `atftp` to upload a file to the TFTP server.
```bash
atftp -p -r newfile.txt -l newfile.txt 192.168.95.145
```

- `-p`: Put/upload
- `-r newfile.txt`: Remote filename on server
- `-l newfile.txt`: Local file to upload
- `192.168.95.145`: TFTP server IP

## Additional Tips for atftp

### Enable verbose/debug output
```bash
atftp --verbose -g -r test.txt -l test.txt 192.168.95.145
```

### Ensure server has write permissions and SELinux isn't blocking
- Directory `/var/lib/tftpboot/` must be writable.
- SELinux may need to be disabled or configured.

### Temporarily disable SELinux
```bash
setenforce 0
```

### Set SELinux context to allow writing
```bash
chcon -t public_content_rw_t /var/lib/tftpboot/
```

## Troubleshooting Tips
- Ensure file exists in TFTP root directory on server.
- Confirm UDP port 69 is allowed through the firewall.
- Capture TFTP traffic with tcpdump:
```bash
tcpdump -i any port 69 -n
```
- Check server logs for access issues.

## Summary
This guide walked through the installation and usage of TFTP clients (`tftp` and `atftp`) on RHEL/CentOS systems. You learned how to configure binary mode, use interactive commands, upload/download files, and handle SELinux and permission issues. With these tools and techniques, you can now easily transfer files over TFTP on your local network.

